# Напишите ваше решение
a = int(input('Число а: '))
b = int(input('Число b: '))
c = int(input('Число с: '))
print(min(a, b, c))