# Напишите ваше решение
bet = 13

salary = int(input('указать ЗП: '))

tax_p = salary / bet
result = salary - tax_p
print(tax_p, result)

